app/views/form/_sidebar.html.erb

                        <li class="active">
                            <a href="<%= timeline_user_path(User.first)%>">
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1