app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = 1 LIMIT 1
INSERT INTO "answers" ("content", "created_at", "question_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "asasa"], ["created_at", Sun, 08 Jun 2014 04:39:02 UTC +00:00], ["question_id", 1], ["updated_at", Sun, 08 Jun 2014 04:39:02 UTC +00:00], ["user_id", 2]]
---
  def create
    @question         = Question.find_by_id params[:question_id]
    @answer           = Answer.new
    @answer.user      = current_user
    @answer.question  = @question
    @answer.content   = params[:answer][:content]
    @answer.save