app/controllers/home_controller.rb

  def index
    @questions = Question.all.page params[:page]
---
SELECT "questions".* FROM "questions" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "questions"