app/controllers/questions_controller.rb

  def create
    question      = Question.new set_params
    question.user = current_user
    respond_to do |format|
      if question.save
        question.create_activity key: 'article.commented_on', owner: current_user
---
INSERT INTO "questions" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "trackable_id", "trackable_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @question     = Question.find_by_id params[:id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = 1 LIMIT 1